// http  технология передачи данных,
// http request запрос состоит:
// url адресс компьютера куда делается запрос
// методы  Rest(get,post, put, delete)
// header(служебная инфа(ключ доступа))
// body(инф которую мы хотим передать на сервер)

// ответ:
// header
// bode
// статус кода(успешно или нет)

// инструменты, для того чтоб делать запросы
// 1. браузер
// 2. postmen (тулы для запросов)
// 3. js (метод fetch)
// любой другой язык программирования

// rest api архитектурный подход, для проектирования сервера(web-servise)
// (сервер спроэктированный по определенным правилам)
// 1. правильный нейминг(после url должно быть одно слово, дальше через /id)

// JSON тип данных(похож на объект), который используется для передачи данных
// у него есть ключ: значение, ключи всегда обернуты в строки(двойные кавычки)
//  в качестве value  может быть только string, number, boolean, array, json

// web-service - is the way for two machines to communicate
// with each other over a network
// (это сущность, которая позволяет обмениваться информацией
// мужду серверами)

// API - сет правил и протоколов, который позволяют коммунтцировать
// между приложениями(набор правил и возможностей, которые дает определенное приложение)
